# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11 object detection models with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # models compound scaling constants, i.e. 'models=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 319 layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 319 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
  m: [0.50, 1.00, 512] # summary: 409 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs
  l: [1.00, 1.00, 512] # summary: 631 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs
  x: [1.00, 1.50, 512] # summary: 631 layers, 56966176 parameters, 56966160 gradients, 196.0 GFLOPs

# 支持版本有__all__ = ['MobileNetV4ConvLarge', 'MobileNetV4ConvSmall', 'MobileNetV4ConvMedium', 'MobileNetV4HybridMedium', 'MobileNetV4HybridLarge'] 5
# YOLO11n backbone
backbone:
  # [from, repeats, module, args]
  # 此处适合专栏里其它的主干可以替换其它任何一个.
  - [-1, 1, MobileNetV4ConvSmall, [0.50]] # 0-4 P1/2 这里是四层大家不要被yaml文件限制住了思维，不会画图进群看视频.
  # 上面的参数0.75支持大家自由根据v11的 0.25 0.50 0.75 1.00 1.5 进行放缩我只尝试过这几个如果你设置一些比较特殊的数字可能会报错.
  # 所以本文有至少 5 x 5 = 25种组合方式.
  - [-1, 1, SPPF, [1024, 5]] # 5
  - [-1, 2, C2PSA, [1024]] # 6

# YOLO11n head
head:
  - [2, 1, Conv, [256]]  # 7-P3/8
  - [3, 1, Conv, [256]]  # 8-P4/16
  - [6, 1, Conv, [256]]  # 9-P5/32

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 10 P5->P4
  - [[-1, 8], 1, Bi_FPN, []] # 11
  - [-1, 3, C2f, [256]] # 12-P4/16

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 13 P4->P3
  - [[-1, 7], 1, Bi_FPN, []] # 14
  - [-1, 3, C2f, [256]] # 15-P3/8

  - [1, 1, Conv, [256, 3, 2]] # 16 P2->P3
  - [[-1, 7, 15], 1, Bi_FPN, []] # 17
  - [-1, 3, C2f, [256]] # 18-P3/8

  - [-1, 1, Conv, [256, 3, 2]] # 19 P3->P4
  - [[-1, 8, 12], 1, Bi_FPN, []] # 20
  - [-1, 3, C2f, [512]] # 21-P4/16

  - [-1, 1, Conv, [256, 3, 2]] # 22 P4->P5
  - [[-1, 9], 1, Bi_FPN, []] # 23
  - [-1, 3, C2f, [1024]] # 24-P5/32

  - [[18, 21, 24], 1, Detect, [nc]]  # Detect(P3, P4, P5)