# YOLO11-P234-FASFFHead_SmallObj.yaml
#相比较于jack基础版，加入了CSPSA
nc: 80  # number of classes

scales:
  n: [0.5, 0.25, 1024]
  s: [0.5, 0.5, 1024]
  m: [0.5, 1.0, 512]
  l: [1.0, 1.0, 512]
  x: [1.0, 1.5, 512]

backbone:
  # Input: 640x640x3
  [[-1, 1, Conv, [64, 3, 2]],        # 0: 320x320
   [-1, 1, Conv, [128, 3, 2]],       # 1: 160x160 (P2)
   [-1, 2, C3k2, [256, False, 0.25]],# 2
   [-1, 1, Conv, [256, 3, 2]],       # 3: 80x80 (P3)
   [-1, 2, C3k2, [512, False, 0.25]],# 4
   [-1, 1, Conv, [512, 3, 2]],       # 5: 40x40 (P4)
   [-1, 2, C3k2, [1024, True]],      # 6 深化特征表达
   [-1, 1, SPPF, [1024, 5]],         # 7 增强感受野
   [-1, 2, C2PSA, [1024]],            # 8 加深建模
   [-1, 1, Conv, [512, 1, 1]],       # 9 通道降维后输出给 P4
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 10 → 80x80 (P3增强)
   [[-1, 4], 1, Concat, [1]],        # 11
   [-1, 2, C3k2, [256, False]],      # 12
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 13 → 160x160 (P2增强)
   [[-1, 1], 1, Concat, [1]],        # 14
   [-1, 2, C3k2, [128, False]]]      # 15

head:
  [
    # 回采后再次下采样，聚合特征
    [-1, 1, Conv, [256, 3, 2]],      # 16 → 80x80
    [[-1, 11], 1, Concat, [1]],      # 17
    [-1, 2, C3k2, [256, False]],     # 18
    [-1, 1, Conv, [512, 3, 2]],      # 19 → 40x40
    [[-1, 8], 1, Concat, [1]],       # 20
    [-1, 2, C3k2, [512, False]],     # 21

    # FASFF 融合（自定义模块）
    [[15, 18, 21], 1, FASFFHead_Jack, ['nc']]  # 输入 P2, P3, P4
  ]
