# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11 object detection models with P2–P4 outputs (P5 removed)

# Parameters
nc: 80  # number of classes
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# Backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]         # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]        # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] # 2
  - [-1, 1, Conv, [256, 3, 2]]        # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 4
  - [-1, 1, Conv, [512, 3, 2]]        # 5-P4/16
  - [-1, 2, C3k2, [512, True]]        # 6

# Neck + Head (without P5)
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]     # 7
  - [[-1, 4], 1, Concat, [1]]                      # 8 cat backbone P3
  - [-1, 2, C3k2, [256, False]]                    # 9

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]     # 10
  - [[-1, 2], 1, Concat, [1]]                      # 11 cat backbone P2
  - [-1, 2, C3k2, [128, False]]                    # 12 (P2)

  - [-1, 1, Conv, [256, 3, 2]]                     # 13
  - [[-1, 9], 1, Concat, [1]]                      # 14 cat P3
  - [-1, 2, C3k2, [256, False]]                    # 15 (P3)

  - [-1, 1, Conv, [512, 3, 2]]                     # 16
  - [[-1, 6], 1, Concat, [1]]                      # 17 cat P4
  - [-1, 2, C3k2, [512, False]]                    # 18 (P4)

  # Detect head: use FASFFHead with P2, P3, P4
  - [[12, 15, 18], 1, FASFFHead_Jack, [nc]]             # Detect(P2, P3, P4)
